package com.dov4k1n.tatarapp.util

val irregularVerbsDefiniteFuture = mapOf(
    /*"у" to mapOf(
        "мин" to "уачакмын",
        "син" to "уачаксың",
        "ул" to "уачак",
        "без" to "уачакбыз",
        "сез" to "уачаксыз",
        "алар" to "уачаклар"
    ),
    "той" to mapOf(
        "мин" to "тоячакмын",
        "син" to "тоячаксың",
        "ул" to "тоячак",
        "без" to "тоячакбыз",
        "сез" to "тоячаксыз",
        "алар" to "тоячаклар"
    ),
    "куй" to mapOf(
        "мин" to "куячакмын",
        "син" to "куячаксың",
        "ул" to "куячак",
        "без" to "куячакбыз",
        "сез" to "куячаксыз",
        "алар" to "куячаклар"
    ),
    "сөй" to mapOf(
        "мин" to "сөячәкмен",
        "син" to "сөячәксең",
        "ул" to "сөячәк",
        "без" to "сөячәкбез",
        "сез" to "сөячәксез",
        "алар" to "сөячәкләр"
    ),
    "ту" to mapOf(
        "мин" to "туачакмын",
        "син" to "туачаксың",
        "ул" to "туачак",
        "без" to "туачакбыз",
        "сез" to "туачаксыз",
        "алар" to "туачаклар"
    ),
    "җый" to mapOf(
        "мин" to "җыячакмын",
        "син" to "җыячаксың",
        "ул" to "җыячак",
        "без" to "җыячакбыз",
        "сез" to "җыячаксыз",
        "алар" to "җыячаклар"
    ),*/
    "яу" to mapOf(
        "мин" to "явачакмын",
        "син" to "явачаксың",
        "ул" to "явачак",
        "без" to "явачакбыз",
        "сез" to "явачаксыз",
        "алар" to "явачаклар"
    ),
    "курык" to mapOf(
        "мин" to "куркачакмын",
        "син" to "куркачаксың",
        "ул" to "куркачак",
        "без" to "куркачакбыз",
        "сез" to "куркачаксыз",
        "алар" to "куркачаклар"
    ),
    "ю" to mapOf(
        "мин" to "юачакмын",
        "син" to "юачаксың",
        "ул" to "юачак",
        "без" to "юачакбыз",
        "сез" to "юачаксыз",
        "алар" to "юачаклар"
    ),
    /*"чык" to mapOf(
        "мин" to "чыгачакмын",
        "син" to "чыгачаксың",
        "ул" to "чыгчак",
        "без" to "чыгачакбыз",
        "сез" to "чыгачаксыз",
        "алар" to "чыгачаклар"
    ),
    "тык" to mapOf(
        "мин" to "тыгачакмын",
        "син" to "тыгачаксың",
        "ул" to "тыгчак",
        "без" to "тыгачакбыз",
        "сез" to "тыгачаксыз",
        "алар" to "тыгачаклар"
    ),
    "так" to mapOf(
        "мин" to "тагачакмын",
        "син" to "тагачаксың",
        "ул" to "тагчак",
        "без" to "тагачакбыз",
        "сез" to "тагачаксыз",
        "алар" to "тагачаклар"
    ),*/
    // ... другие неправильные глаголы
)