package com.dov4k1n.tatarapp.util

val irregularVerbsIndefiniteFuture = mapOf(
    "эл" to mapOf(
        "мин" to "эләрмен",
        "син" to "эләрсең",
        "ул" to "эләр",
        "без" to "эләрбез",
        "сез" to "эләрсез",
        "алар" to "эләрләр"
    ),
    "көл" to mapOf(
        "мин" to "көләрмен",
        "син" to "көләрсең",
        "ул" to "көләр",
        "без" to "көләрбез",
        "сез" to "көләрсез",
        "алар" to "көләрләр"
    ),
    "курык" to mapOf(
        "мин" to "куркырмын",
        "син" to "куркырсың",
        "ул" to "куркыр",
        "без" to "куркырбыз",
        "сез" to "куркырсыз",
        "алар" to "куркырлар"
    )
    // ... другие неправильные глаголы
)